ERP.belugaerp/src/InformationRegisters/бг_ДанныеПерегрузок/бг_ДанныеПерегрузок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ДанныеПерегрузок</name>
  <comment>Регистр служит для отражения перегрузки товаров из одного транспортного средства в другое во время перевозки товара</comment>
  <resources>
    <name>ДатаПерегрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзмененоПравоСобственности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Перевозчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаркаТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Заказчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПунктПогрузки</name>
    <comment>Адрес перегрузки</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПунктРазгрузки</name>
    <comment>Адрес перегрузки</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Перенаправление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТНЕГАИС</name>
    <comment>Ссылка на транспортную накладную ЕГАИС (КТ-2000)</comment>
    <type>
      <types>DocumentRef.ТранспортнаяНакладнаяЕГАИС</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФиксации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.битМаршрутныйЛист</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <comment>Учетный документ</comment>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПерегрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ДанныеПерегрузок/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает имена измерений регистра, разделенные запятыми
//
// Возвращаемое значение:
//  Строка  - Строка, содержащая имена измерений регистра
//
Функция ИзмеренияРегистраСтрока() Экспорт
	Результат = Новый Массив;
	Для каждого Измерение Из Метаданные.РегистрыСведений.бг_ДанныеПерегрузок.Измерения Цикл
		Результат.Добавить(Измерение.Имя);
	КонецЦикла;
	Возврат СтрСоединить(Результат, ",");
КонецФункции

// Возвращает структуру измерений регистра
//
// Параметры:
//  ДанныеЗаполнения - Структура, ВыборкаИзРезультатовЗапроса, СтрокаТаблицыЗначений - содержит значения измерений регистра
//  
// Возвращаемое значение:
//  Структура - содержит значения измерений регистра
//
Функция СтруктураИзмерений(ДанныеЗаполнения = Неопределено) Экспорт
	Результат = Новый Структура(ИзмеренияРегистраСтрока());
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДанныеЗаполнения);
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Устанавливает документ ЕГАИС для переданных измерений
//
// Параметры:
//  СтруктураИзмерений - Структура - содержит значения измерений регистра
//  Документ - ДокументСсылка.ТранспортнаяНакладнаяЕГАИС - Документ, который необходимо привязать
//
Процедура УстановитьДокументЕГАИС(СтруктураИзмерений, Документ) Экспорт
	НаборЗаписей = РегистрыСведений.бг_ДанныеПерегрузок.СоздатьНаборЗаписей();
	Для каждого Измерение Из Метаданные.РегистрыСведений.бг_ДанныеПерегрузок.Измерения Цикл
		НаборЗаписей.Отбор[Измерение.Имя].Установить(СтруктураИзмерений[Измерение.Имя]);
	КонецЦикла;
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда 
		НаборЗаписей[0].ТНЕГАИС = Документ;
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеИзменятьОтветственного");
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
КонецПроцедуры	

// Возвращает соответствие Объекта номеру последней перегрузки
//
// Параметры:
//  Объекты - массив из ДокументСсылка, для которых определяем номер перегрузки
//  
// Возвращаемое значение:
//  Соответствие - по каждому из переданых объектов определяется номер последней перегрузки
//
Функция ОпределитьНомераПерегрузок(Объекты) Экспорт 
	Результат = Новый Соответствие;
	Для каждого Объект Из Объекты Цикл
		Результат.Вставить(Объект, 0);
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_ДанныеПерегрузок.Объект КАК Объект,
	|	МАКСИМУМ(бг_ДанныеПерегрузок.НомерПерегрузки) КАК НомерПерегрузки
	|ИЗ
	|	РегистрСведений.бг_ДанныеПерегрузок КАК бг_ДанныеПерегрузок
	|ГДЕ
	|	бг_ДанныеПерегрузок.Объект В(&Объекты)
	|
	|СГРУППИРОВАТЬ ПО
	|	бг_ДанныеПерегрузок.Объект";
	Запрос.УстановитьПараметр("Объекты", Объекты);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Объект, Выборка.НомерПерегрузки);
	КонецЦикла;                                                     
	Возврат Результат;
КонецФункции

// Возвращает транспортные накладные по объекту
//
// Параметры:
//  Объект - ДокументСсылка, для которого определяем созанные транспортные накладные ЕГАИС
//  НомерПерегрузки - Число - текущий номер перегрузки для ограничения, если 0, то все
//  
// Возвращаемое значение:
//  Массив из ДокументСсылка.ТранспортнаяНакладнаяЕГАИС
//
Функция ТранспортныеНакладныеОбъекта(Объект, НомерПерегрузки = 0) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("НомерПерегрузки", НомерПерегрузки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_ДанныеПерегрузок.ТНЕГАИС КАК ТНЕГАИС
	|ИЗ
	|	РегистрСведений.бг_ДанныеПерегрузок КАК бг_ДанныеПерегрузок
	|ГДЕ
	|	бг_ДанныеПерегрузок.Объект = &Объект
	|	И ВЫБОР
	|			КОГДА &НомерПерегрузки = 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ бг_ДанныеПерегрузок.НомерПерегрузки < &НомерПерегрузки
	|		КОНЕЦ";
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТНЕГАИС");;
	Возврат Результат;
КонецФункции

#КонецОбласти
